> Thinking more about [my last question](https://github.com/terraform-providers/terraform-provider-vcd/pull/441#pullrequestreview-352832978) of inability to **update** adapter type on existing VM.
> 
> In UI this field is read-only, hence the users are not allowed to change it. On the other hand, we allow to change it and get the error message. If there is a case where such update would work, it makes sense. If not, then we should do one of the following:
> 
> a. Warn the user in documentation that updating the value in adapter_type is usually unsupported by the underlying infrastructure and would cause an error.
> 
> b. Force recreation of the whole corresponding `network` block (the connection itself), but if there's no standard (non-hack) way of implementing (and representing in the _plan_) such recreation of only a block in a resource, let's _not_ overdo it. A sentence in documentation would be enough.
> 
> LGTM, otherwise :)

Yes. There is a problem - if I add the native Terraform `ForceNew: true` it will propose to re-provision whole resource on `adapter_type` change. It does not do so if I remove an existing adapter, but will always proposes to recreate whole resource if I add a new adapter.
Consider this workflow:
1. Provision VM with some specific adapter type
2. Remove definition of that block and apply (removing the block does not propose to recreate VM, just removes the adapter). I do this with intention to insert an adapter with different type later.
3. Add an adapter back with different type. And then the **problem occurs** (it proposes to recreate resource):
```
 # vcd_vapp_vm.TestAccVcdVAppVmMultiNICVM must be replaced
-/+ resource "vcd_vapp_vm" "TestAccVcdVAppVmMultiNICVM" {
        accept_all_eulas               = true
        catalog_name                   = "my-catalog"
      ~ computer_name                  = "PhotonOS-001" -> (known after apply)
        cpu_cores                      = 1
        cpus                           = 2
      ~ description                    = "photon-os-description" -> (known after apply)
        expose_hardware_virtualization = false
      - guest_properties               = {} -> null
      ~ href                           = "https://192.168.1.109/api/vApp/vm-99da32de-0a9e-40fe-bd1a-1124b805044a" -> (known after apply)
      ~ id                             = "urn:vcloud:vm:99da32de-0a9e-40fe-bd1a-1124b805044a" -> (known after apply)
      ~ internal_disk                  = [
          - {
              - bus_number       = 0
              - bus_type         = "paravirtual"
              - disk_id          = "2000"
              - iops             = 0
              - size_in_mb       = 16384
              - storage_profile  = "Development"
              - thin_provisioned = true
              - unit_number      = 0
            },
        ] -> (known after apply)
      + ip                             = (known after apply)
      + mac                            = (known after apply)
        memory                         = 512
      - metadata                       = {} -> null
        name                           = "TestAccVcdVAppVmMultiNICVM"
        org                            = "my-org"
        power_on                       = true
      ~ storage_profile                = "Development" -> (known after apply)
        template_name                  = "photon-os"
        vapp_name                      = "TestAccVcdVAppVmMultiNIC"
        vdc                            = "my-org-vdc"

      ~ network {
          ~ adapter_type       = "VMXNET3" -> (known after apply)
          ~ ip                 = "11.10.0.152" -> (known after apply)
            ip_allocation_mode = "POOL"
          - is_primary         = true -> null
          ~ mac                = "00:50:56:01:31:7b" -> (known after apply)
            name               = "multinic-net"
            type               = "org"
        }
      + network {
          + adapter_type       = "E1000E" # forces replacement
          + ip                 = (known after apply)
          + ip_allocation_mode = "DHCP"
          + is_primary         = true
          + mac                = (known after apply)
          + name               = "multinic-net"
          + type               = "org"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

In general, it would break the functionality of simply adding a new network adapter so this won't work.

As a result of this experiment I am going with your option **a** and added a note into website docs.